# IsValidParam Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementPath..::..IsValidParam Method
DisplacementPath Class See Also
---
Is the specified value a valid edge or curve parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsValidParam(
	double param
)
```

Visual Basic
---
```text
Public Shared Function IsValidParam ( _
	param As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidParam(
	double param
)
```

# ### Parameters
param
    Type: System..::..Double proposed edge parameter.
# See Also
DisplacementPath Class
Autodesk.Revit.DB Namespace